alexdauenhauer.catppuccin-noctis
astro-build.astro-vscode
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
crnobog.red-vintage-theme
davidanson.vscode-markdownlint
eamodio.gitlens
eliverlara.andromeda
enkia.tokyo-night
esbenp.prettier-vscode
evondev.dracula-high-contrast
fill-labs.dependi
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
golang.go
lewxdev.vscode-glyph
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
nichabosh.minimalist-dark
pixelzdesign.sertranslit
pkief.material-icon-theme
pkief.material-product-icons
redhat.java
ritwickdey.liveserver
robbowen.synthwave-vscode
rust-lang.rust-analyzer
s-nlf-fh.glassit
sdras.night-owl
silofy.hackthebox
supermaven.supermaven
svelte.svelte-vscode
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tomoki1207.pdf
twxs.cmake
tyriar.luna-paint
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vue.volar
wakatime.vscode-wakatime